---
kind: property
id: P:Autodesk.Revit.DB.Structure.FabricSheetType.OverallLength
source: html/55a5614f-61c8-3808-1ffd-6d6b6faf14e4.htm
---
# Autodesk.Revit.DB.Structure.FabricSheetType.OverallLength Property

The length of the wire sheet (including overhangs) in the major direction.

## Syntax (C#)
```csharp
public double OverallLength { get; }
```